# working with data part 2
## V40 Permutation

In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [5]:
dframe=DataFrame(np.arange(16).reshape(4,4))
dframe

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
 np.random.randn(5)

array([ 0.52168013, -0.41192018, -0.50975352,  0.21806989, -0.41087243])

In [12]:
blender = np.random.permutation(4)
#permutation = جایگشت

In [13]:
blender

array([3, 1, 0, 2])

In [14]:
dframe

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [21]:
dframe.take(blender)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11

In [20]:
dframe.take(blender,axis=1)

    3   1   0   2
0   3   1   0   2
1   7   5   4   6
2  11   9   8  10
3  15  13  12  14

In [16]:
box=np.array([1,2,3])

In [17]:
#permutation with replacement ==> randint
shaker=np.random.randint(0,len(box),size=10)
shaker

array([2, 0, 0, 0, 1, 0, 2, 1, 0, 0])

In [18]:
hand_grabs=box.take(shaker)
hand_grabs

array([3, 1, 1, 1, 2, 1, 3, 2, 1, 1])

## V28 Merge

In [23]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [25]:
dframe1=DataFrame({'key':['X','Y','T','X','Y','Y'],
                  'data_set_1':np.arange(6)})
dframe1

  key  data_set_1
0   X           0
1   Y           1
2   T           2
3   X           3
4   Y           4
5   Y           5

In [27]:
dframe2=DataFrame({'key':list('QYZ'),'data_set_2':list("123")})
dframe2

  key data_set_2
0   Q          1
1   Y          2
2   Z          3

In [28]:
pd.merge(dframe1,dframe2)

  key  data_set_1 data_set_2
0   Y           1          2
1   Y           4          2
2   Y           5          2

In [29]:
pd.merge(dframe1,dframe2,on='key')

  key  data_set_1 data_set_2
0   Y           1          2
1   Y           4          2
2   Y           5          2

In [30]:
pd.merge(dframe1,dframe2,on='key',how='left')

  key  data_set_1 data_set_2
0   X           0        NaN
1   Y           1          2
2   T           2        NaN
3   X           3        NaN
4   Y           4          2
5   Y           5          2

In [31]:
pd.merge(dframe1,dframe2,on='key',how='right')

  key  data_set_1 data_set_2
0   Y         1.0          2
1   Y         4.0          2
2   Y         5.0          2
3   Q         NaN          1
4   Z         NaN          3

In [32]:
pd.merge(dframe1,dframe2,on='key',how='outer')

  key  data_set_1 data_set_2
0   X         0.0        NaN
1   X         3.0        NaN
2   Y         1.0          2
3   Y         4.0          2
4   Y         5.0          2
5   T         2.0        NaN
6   Q         NaN          1
7   Z         NaN          3

In [33]:
dframe3=DataFrame({'key':list('XXXYZZ'),'data_set_3':range(6)})

In [34]:
dframe4=DataFrame({'key':list('YYXXZ'),'data_set_4':range(5)})

In [35]:
dframe3

  key  data_set_3
0   X           0
1   X           1
2   X           2
3   Y           3
4   Z           4
5   Z           5

In [37]:
dframe4

  key  data_set_4
0   Y           0
1   Y           1
2   X           2
3   X           3
4   Z           4

In [39]:
pd.merge(dframe3,dframe4)

  key  data_set_3  data_set_4
0   X           0           2
1   X           0           3
2   X           1           2
3   X           1           3
4   X           2           2
5   X           2           3
6   Y           3           0
7   Y           3           1
8   Z           4           4
9   Z           5           4

In [41]:
df_left=DataFrame({'key1':['SF','SF','LA'],
                   'key2':['one','two','one'],
                  'left_data':[10,20,30]})
df_left

  key1 key2  left_data
0   SF  one         10
1   SF  two         20
2   LA  one         30

In [45]:
df_right=DataFrame({'key1':['SF','SF','LA','LA'],
                    'key2':['one','one','one','two'],
                   'right_data':[40,50,60,70]})
df_right

  key1 key2  right_data
0   SF  one          40
1   SF  one          50
2   LA  one          60
3   LA  two          70

In [46]:
pd.merge(df_left,df_right,on=['key1','key2'],how='outer')

  key1 key2  left_data  right_data
0   SF  one       10.0        40.0
1   SF  one       10.0        50.0
2   SF  two       20.0         NaN
3   LA  one       30.0        60.0
4   LA  two        NaN        70.0

In [47]:
pd.merge(df_left,df_right,on='key1')

  key1 key2_x  left_data key2_y  right_data
0   SF    one         10    one          40
1   SF    one         10    one          50
2   SF    two         20    one          40
3   SF    two         20    one          50
4   LA    one         30    one          60
5   LA    one         30    two          70

In [48]:
pd.merge(df_left,df_right,on='key1',suffixes=('_lefty','_righty'))

  key1 key2_lefty  left_data key2_righty  right_data
0   SF        one         10         one          40
1   SF        one         10         one          50
2   SF        two         20         one          40
3   SF        two         20         one          50
4   LA        one         30         one          60
5   LA        one         30         two          70

In [53]:
# For more info on merge parameters check out:
url = 'http://pandas.pydata.org/pandas-docs/dev/generated/pandas.DataFrame.merge.html'

In [54]:
import webbrowser

In [56]:
webbrowser.open(url)

True

# V29 Merge on index

In [72]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [73]:

df_left=DataFrame({'key':list('XYZXY'),'data_set':range(5)})

In [80]:
df_left

  key  data_set
0   X         0
1   Y         1
2   Z         2
3   X         3
4   Y         4

In [83]:
df_right=DataFrame({'group_data':[10,20]},index=['X','Y'])
df_right

   group_data
X          10
Y          20

In [86]:
pd.merge(df_left,df_right,left_on='key',right_index=True)

TypeError: object of type 'NoneType' has no len()